Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 128)               4480      
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_4 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_5 (Dense)              (None, 6)                 774       
=================================================================
Total params: 71,302
Trainable params: 71,302
Non-trainable params: 0
_________________________________________________________________

test loss, test acc: [0.00790645182132721, 0.9676923155784607]